### 1. Importing Libraries

In [4]:
import pandas as pd
import numpy as np
import os

## Using df.concat()

### #Creating dictionaries for January and February customer data

In [30]:
#Define your dictionary containing January Data
data1={'customer_id': ['6732', '767', '890', '635'],
      'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
      'purchased_meats':[0, 13, 3, 4],
      'purchased_alcohol':[1, 2, 10, 0],
      'purchased_snacks':[10, 5, 1, 7]}

In [31]:
data2={'customer_id': ['6732', '767', '890', '635'],
       'month': ['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
       'purchased_meats': [0, 10, 5, 3],
       'cpurchased_alcohol': [2, 4, 14, 0],
       'purchased_snacks': [15, 3, 2, 6],
      }

In [32]:
## Using pandas, we will convert the first dictionary into a dataframe
df=pd.DataFrame(data1, index=[0, 1, 2, 3])

In [33]:
## Using pandas, we will convert the second dictionary into a dataframe
df1=pd.DataFrame(data2, index=[0, 1, 2, 3])

In [34]:
#Testinf df
df

  customer_id   month  purchased_meats  purchased_alcohol  purchased_snacks
0        6732  Jan-20                0                  1                10
1         767  Jan-20               13                  2                 5
2         890  Jan-20                3                 10                 1
3         635  Jan-20                4                  0                 7

In [35]:
df1

  customer_id   month  purchased_meats  cpurchased_alcohol  purchased_snacks
0        6732  Feb-20                0                   2                15
1         767  Feb-20               10                   4                 3
2         890  Feb-20                5                  14                 2
3         635  Feb-20                3                   0                 6

In [36]:
## Creating a list containg dataframes which will be concatenated
frames=[df, df1]

In [37]:
## Concatenating both dataframes using pd.concat func (list has to be used, which is why we created 'frames' list)
df_concat=pd.concat(frames)

In [38]:
df_concat

,customer_id,month,purchased_meats,purchased_alcohol,purchased_snacks,cpurchased_alcohol
0,6732,Jan-20,0,1.0,10,NaN
1,767,Jan-20,13,2.0,5,NaN
2,890,Jan-20,3,10.0,1,NaN
3,635,Jan-20,4,0.0,7,NaN
0,6732,Feb-20,0,NaN,15,2.0
1,767,Feb-20,10,NaN,3,4.0
2,890,Feb-20,5,NaN,2,14.0
3,635,Feb-20,3,NaN,6,0.0

## Using df.merge()

In [39]:
#Before we utilize the df.merge() func, we need to create a third dictionary with slight different format
data3={'customer_id': ['6732', '767', '890', '635'],
      'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
      'days_purchased_on': [0, 10, 4, 1]}

In [41]:
#Now, we turn the third dictionary into a third dataframe using pd.DataFrame() function
df2=pd.DataFrame(data3, index=[0, 1, 2, 3])

In [46]:
#Merging the different size dataframes using df.merge() and 'customer_id' and 'month' as connecting keys
df_merged=df.merge(df2, on=['customer_id', 'month'])

In [47]:
df_merged

,customer_id,month,purchased_meats,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1

In [48]:
#Using indicator=True, we now will check if there is a partial or full match between both dataframes 
#that were merged

df_merged = df.merge(df2, on = ['customer_id', 'month'], indicator = True)

In [49]:
#Here, we are calling the dataframe we just created to check match status
df_merged

,customer_id,month,purchased_meats,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

In [50]:
#both means there is a full match
#left_only means the key only exists in left dataframe
#right_only means the key only exists in right dataframe